trunk/Recycler/SandStorm/skysoapd/tests/getAllServiceSummaries_response.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope
   xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
   xmlns:tns="http://tempuri.org/"
   xmlns:types="http://tempuri.org/encodedTypes"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema">

  <soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <q1:getAllServiceSummaries xmlns:q1="http://www.xmethods.net/interfaces/query.xsd">

       <Result soapenc:arrayType="sky:ServiceSummary[2]"
               xmlns:sky="http://www.xmethods.net/interfaces/query.xsd">
          <item>
             <name>name1</name>
             <id>id1</id>
             <shortDescription>shortDescription</shortDescription>
             <wsdlURL>http://wsdlUrl.net</wsdlURL>
             <publisherID>pubId_unique</publisherID>
          </item>

          <item>
             <name>name2</name>
             <id>id2</id>
             <shortDescription>shortDescription2</shortDescription>
             <wsdlURL>2wsdlUrl.net</wsdlURL>
             <publisherID>pubId_unique1</publisherID>
          </item>

       </Result>
    </q1:getAllServiceSummaries>

  </soap:Body>
</soap:Envelope>
